{"card_name": "A Kindness Abused", "color": "G", "rarity": "rare", "type": "Instant", "number": 122, "color_identity": "G", "cost": "{X}{G}{G}{G}{G}", "rules_text": "Put a creature card from your hand onto the battlefield. It gets +X/+X and gains trample, haste, and hexproof until end of turn.", "flavor_text": "[i]Dajaman insisted that the strangers be welcomed peacefully — and that charity left it with no defence against their wrath.[/i]", "pt": "", "special_text": "", "shape": "modal double faced", "set": "KLC2", "loyalty": "", "artist": "Targete", "card_name2": "Dajaman, the Open Hand", "color2": "G", "type2": "Legendary Planeswalker – Dajaman", "cost2": "{2}{G}{G}", "rules_text2": "", "flavor_text2": "[i][/i]", "pt2": "", "special_text2": "\n[-10]: Dajaman deals damage to target opponent equal to your life total and to you equal to that player's life total.", "loyalty2": "3", "artist2": "Themefinland", "notes": "!tag:Vasille\n!tag:Dajaman\n!rant below\n\nhonestly dajaman is one character I've always felt insecure about character-building in a cohesive and actually characterful way, partially because he's the closest I have to just being, like, a normal guy. he started out as just a generic nice himbo fighter guy, and I felt like I wasn't doing enough, and over time I started growing more and more onto him and fleshing him out more and more into his own beast, and I can only hope I've managed by this point to create something that's cohesive and doesn't just come across as \"random generic thoughts incoherently put together\", like I fear he has been in previous iterations. \n\nI think the thing that makes me feel like I'm not succeeding at creating a coherent character is that he's not defined around a single cause or event, he does have some solid motivations, but ultimately he just does what he feels like and wants to live a simple life and be happy and help people because that's what makes him more comfortable. and I think that's been a consistent thing in all my years of doing stuff with this guy. he's fluctuating and emotionally flexible, he's driven by his emotions and his instincts, and sometimes those can contradict. and maybe that's what's causing the insecurity in me. those things have consistently had a _direction_ and _limitations_ (again, a nice guy), but that sort of looser characterization made me feel like I'm not succeeding at giving him _any_ characterization. but \n\nof course, this rant only really makes sense to you if you're an oldhead and were around during this guy's stint on the battle boards. if you're only just now hearing about this guy, well, feel free to disregard this. but either way, if you're reading this, I just hope I've been able to do this guy justice and make, like, _a character_, with actual definable _character_.\n\n(I can have one color pie fucky walker ult, as a treat)", "image_type": "png"}